$(document).ready(function(){
	/*
	Виконайте дані завдання з допомогою цикла for і while

	1. Створіть змінні a = 17 і b = 10. 
	Відніміть від a змінну b і результат надайте змінної c. 
	Потім створіть змінну d, надайте їй значення 7. 
	Складіть змінні c і d, а результат запишіть в змінну result. 
	Виведіть на екран значення змінної result.

	2. Створіть змінну str і надайте їй значення 'abcde'. 
	Звертаючись до окремих символів цього рядка виведіть на екран символ 'a', 
	символ 'c', символ 'e'.

	3. Напишіть скрипт, який рахує кількість секунд в годині, в добі, в місяці.

	4. В стовпчик виведіть числа від 1 до 50.

	5. Виведіть всі парні числа в діапазоні від 1 до 20.

	6. Виведіть всі прості числа в діапазоні від 2 до 30.
	*/

	//2
	var str = 'abcde';

	for(var i = 0; i < str.length; i += 2) {
		alert(str[i]);
	}

	//3
	var second = 1;
	var minute = second * 60;
	var hour = minute * 60;
	var day = hour * 24;
	var month = day * 31;

	for(var i = 0; i <= month; i++) {
		if(i === minute || i === hour || i === day || i === month) {
			alert(i);
		}
	}

	//4
	for(var i = 0; i < 51; i++) {
		$('body').append('<div>' + i + '<div>');
	}

	//5
	for(var i = 1; i <= 20; i++) {
		if (i % 2 !== 0) continue;
		alert('парне ' + i);
	}

	//6
	next:
  	for (var i = 2; i <= 30; i++) {

    	for (var j = 2; j < i; j++) {
      		if (i % j == 0) continue next;
    }

    alert('просте ' + i);
  }


});